/**
 * Created by starov on 28.07.14.
 */

fruitStory.service('Designs', function () {
    this.designs=[
        {
            "letters": "H",
            "title": "Башня Наблюдателя",
            "img": "http://fondfrukt.ru/images/observer-tower-list.svg",
            "text": "Памятник одному из величайших открытий XX века — квантовой механике и новому взгляду на окружающий нас мир, который она нам подарила. Уже каждому, наверняка, известно, насколько большая роль на квантовом уровне отводится Наблюдателю, тому, кто превращает бесконечное поле вероятностей в познаваемый физический мир. Башня позволит каждому ощутить себя тем самым Наблюдателем, одним только взглядом творящим Вселенную.",
            "icon": "icons/design.svg"
        },
        {
            "letters": "O",
            "title": "Ooley",
            "img": "http://ooley.ru/logos/ooley-square-card-filled.svg",
            "text": "[**Ooley**](http://www.ooley.ru) – система открытых мастерских",
            "icon": "icons/design.svg"
        },
        {
            "letters": "M",
            "title": "Помещения для медитации",
            "img": "http://fondfrukt.ru/images/sawaki4.jpg",
            "icon": "icons/design.svg"
        },
        {
            "letters": "P",
            "title": "Форум",
            "img": "http://fondfrukt.ru/images/page2-img3.jpg",
            "text": "Открытый колонно-купольный зал встреч и собраний. *Демократия без форума немыслима.*",
            "icon": "icons/design.svg"
        },
        {
            "letters": "A",
            "title": "ФРУКТ",
            "img": "http://fondfrukt.ru/images/fruits.svg",
            "text": "## Фонд Развития Универсализации, Кооперации, Творчества\nhttp://www.fondfrukt.ru",
            "icon": "icons/design.svg"
        },
        {
            "letters": "K",
            "title": "Открытая здоровая кухня",
            "img": "http://fondfrukt.ru/images/ozk.svg",
            "icon": "icons/design.svg"
        },
        {
            "letters": "O|E",
            "title": "Идея",
            "text": "Система открытых мастерских с разнообразными **возможностями**, открытыми для максимально широкого круга **лиц**."
        },
        {
            "letters": "O|X",
            "title": "Цель",
            "text": "Обеспечить возможность широкого распространения **навыков**, а также доступ к соответствующему **инструменту**, разнообразным **материалам** и творческим **результатам**."
        },
        {
            "letters": "O|C",
            "title": "Суть",
            "text": "Создание и развитие различных открытых мастерских, объединенных системой  накопления и использования возможностей, а также доступа и взаимодействия лиц."
        },
        {
            "letters": "O|T",
            "title": "Система Ooley",
            "img": "http://ooley.ru/logos/ooley-logo.svg",
            "text": "Набор правил, регулирующих взаимодействия лиц, инструмента и материалов, а также взаимообращения навыков и творческих результатов."
        },
        {
            "letters": "O|T|O",
            "title": "Смотреть может каждый.",
            "text": "Мастерские делаются по возможности наиболее открытыми  для просмотра любым заинтересованным лицам."
        },
        {
            "letters": "O|T|B",
            "title": "Открытыми возможностями можно пользоваться свободно.",
            "text": "Мастерские способствуют открытию различных возможностей для использования всеми заинтересованными лицами."
        },
        {
            "letters": "O|T|H",
            "title": "Доступ к инструменту только при наличии соответствующего навыка",
            "img": "",
            "text": "**Навык** — умение реализовывать **известные задачи** или получать **творческие результаты** с применением соответствующего **инструмента** по **назначению**, а также **руководство** по овладению им."
        },
        {
            "letters": "O|T|H",
            "title": "Доступ к инструменту только при наличии соответствующего навыка",
            "text": "Навык — умение реализовывать известные задачи или получать творческие результаты с применением соответствующего инструмента по назначению, а также руководство по овладению им.",
            "img": "icons/skill.svg"
        },
        {
            "letters": "O|T|K",
            "title": "Закрытые возможности открываются по записи или соответствующими вложениями.",
            "text": "**Возможности** могут быть закрыты по причине отсутствия **лица** с соответствующим **навыком**, а также при недостаточности средств для их открытия."
        },
        {
            "letters": "O|T|H|P",
            "title": "Приобрести существующий навык",
            "text": "**Имеющийся навык** можно приобрести выполнив известную задачу в присутствии, при поддержке и под руководством уже имеющего этот навык."
        },
        {
            "letters": "O|T|H|H",
            "title": "Доказать новый навык",
            "text": "**Новый навык** можно **доказать**, получив заранее определенные творческие результаты в присутствии и при поддержке **лиц**, имеющих близкие навыки."
        },
        {
            "letters": "O|P",
            "title": "Ooley в прицепе",
            "icon": "icons/stage.svg",
            "img": "https://pp.vk.me/c408930/v408930086/1b27/qDr0oOnmOJE.jpg",
            "text": "Прицеп-автодом, оборудованный под разворачиваемую открытую мастерскую."
        },
        {
            "letters": "Y",
            "icon": "icons/design.svg",
            "img": "http://www.ooway.ru/images/ooway-poster.svg",
            "title": "Ooway",
            "text": "[**OOWAY**](http://www.ooway.ru) — это видео-журнал о медитации. Мы ставим своей целью донести до человечества понимание того, что созерцательная концентрация и успокоение ума в медитации уже давно перестало быть атрибутом какой-либо религиозной традиции , и для все большего числа людей становится неотъемлемой частью их жизни, позволяющей разобраться с трудностями жизни и лучше понять себя и окружающих."
        },
        {
            "letters": "B",
            "title": "Международный буквенный счет и учет",
            "img": "http://www.fondfrukt.ru/images/set1.svg",
            "text": "## АВЕКМНОРСТУХ\nУниверсальная двенадцатибуквенная система счета уникальных объектов, а также их взаимосвязей."
        },
        {
            "letters": "C",
            "title": "Фруктовый дискурс",
            "img": "http://www.fondfrukt.ru/images/icons-exp.svg",
            "text": "Язык и система целенаправленного общения и взаимодействия людей."
        }
    ]
});
