/**
 * Created by starov on 28.07.14.
 */

fruitStory.service('Designs', function () {
    this.designs=[
        {
            "letters":"H",
            "title":"Башня Наблюдателя",
            "icon":"icons/design.svg",
            "text":"Памятник одному из величайших открытий XX века — квантовой механике и новому взгляду на окружающий нас мир, который она нам подарила. Уже каждому, наверняка, известно, насколько большая роль на квантовом уровне отводится Наблюдателю, тому, кто превращает бесконечное поле вероятностей в познаваемый физический мир. Башня позволит каждому ощутить себя тем самым Наблюдателем, одним только взглядом творящим Вселенную.",
            "img":"http://fondfrukt.ru/images/page2-img1.jpg"
        }
    ]
});
