/**
 * Created by starov on 28.07.14.
 */

fruitStory.service('Designs', function () {
    this.designs=[
        {
            "letters": "H",
            "title": "Башня Наблюдателя",
            "img": "http://fondfrukt.ru/images/observer-tower-list.svg",
            "text": "Памятник одному из величайших открытий XX века — квантовой механике и новому взгляду на окружающий нас мир, который она нам подарила. Уже каждому, наверняка, известно, насколько большая роль на квантовом уровне отводится Наблюдателю, тому, кто превращает бесконечное поле вероятностей в познаваемый физический мир. Башня позволит каждому ощутить себя тем самым Наблюдателем, одним только взглядом творящим Вселенную.",
            "type":"design"
        },
        {
            "letters": "O",
            "title": "Ooley",
            "img": "http://ooley.ru/logos/ooley-square-card-filled.svg",
            "text": "[**Ooley**](http://www.ooley.ru) – система открытых мастерских",
            "type":"design"
        },
        {
            "letters": "M",
            "title": "Помещения для медитации",
            "img": "http://fondfrukt.ru/images/sawaki4.jpg",
            "type":"design"
        },
        {
            "letters": "P",
            "title": "Форум",
            "img": "http://fondfrukt.ru/images/page2-img3.jpg",
            "text": "Открытый колонно-купольный зал встреч и собраний. *Демократия без форума немыслима.*",
            "type":"design"
        },
        {
            "letters": "A",
            "title": "ФРУКТ",
            "img": "http://fondfrukt.ru/images/fruits.svg",
            "text": "## Фонд Развития Универсализации, Кооперации, Творчества\nhttp://www.fondfrukt.ru",
            "type":"design"
        },
        {
            "letters": "K",
            "title": "Открытая здоровая кухня",
            "img": "http://fondfrukt.ru/images/ozk.svg",
            "type":"design"
        },
        {
            "letters": "O|E",
            "title": "Идея",
            "text": "Система открытых мастерских с разнообразными **возможностями**, открытыми для максимально широкого круга **лиц**."
        },
        {
            "letters": "O|X",
            "title": "Цель",
            "text": "Обеспечить возможность широкого распространения **навыков**, а также доступ к соответствующему **инструменту**, разнообразным **материалам** и творческим **результатам**."
        },
        {
            "letters": "O|C",
            "title": "Суть",
            "text": "Создание и развитие различных открытых мастерских, объединенных системой  накопления и использования возможностей, а также доступа и взаимодействия лиц."
        },
        {
            "letters": "O|T",
            "title": "Система Ooley",
            "img": "http://ooley.ru/logos/ooley-logo.svg",
            "text": "Набор правил, регулирующих взаимодействия лиц, инструмента и материалов, а также взаимообращения навыков и творческих результатов."
        },
        {
            "letters": "O|T|O",
            "title": "Смотреть может каждый.",
            "text": "Мастерские делаются по возможности наиболее открытыми  для просмотра любым заинтересованным лицам."
        },
        {
            "letters": "O|T|B",
            "title": "Открытыми возможностями можно пользоваться свободно.",
            "text": "Мастерские способствуют открытию различных возможностей для использования всеми заинтересованными лицами."
        },
        {
            "letters": "O|T|H",
            "title": "Доступ к инструменту только при наличии соответствующего навыка",
            "img": "",
            "text": "**Навык** — умение реализовывать **известные задачи** или получать **творческие результаты** с применением соответствующего **инструмента** по **назначению**, а также **руководство** по овладению им."
        },
        {
            "letters": "O|T|H",
            "title": "Доступ к инструменту только при наличии соответствующего навыка",
            "text": "Навык — умение реализовывать известные задачи или получать творческие результаты с применением соответствующего инструмента по назначению, а также руководство по овладению им.",
            "type": "skill"
        },
        {
            "letters": "O|T|K",
            "title": "Закрытые возможности открываются по записи или соответствующими вложениями.",
            "text": "**Возможности** могут быть закрыты по причине отсутствия **лица** с соответствующим **навыком**, а также при недостаточности средств для их открытия."
        },
        {
            "letters": "O|T|H|P",
            "title": "Приобрести существующий навык",
            "text": "**Имеющийся навык** можно приобрести выполнив известную задачу в присутствии, при поддержке и под руководством уже имеющего этот навык."
        },
        {
            "letters": "O|T|H|H",
            "title": "Доказать новый навык",
            "text": "**Новый навык** можно **доказать**, получив заранее определенные творческие результаты в присутствии и при поддержке **лиц**, имеющих близкие навыки."
        },
        {
            "letters": "O|P",
            "title": "Ooley в прицепе",
            "type":"stage",
            "img": "https://pp.vk.me/c408930/v408930086/1b27/qDr0oOnmOJE.jpg",
            "text": "Прицеп-автодом, оборудованный под разворачиваемую открытую мастерскую."
        },
        {
            "letters": "Y",
            "type":"design",
            "img": "http://www.ooway.ru/images/ooway-poster.svg",
            "title": "Ooway",
            "text": "[**OOWAY**](http://www.ooway.ru) — это видео-журнал о медитации. Мы ставим своей целью донести до человечества понимание того, что созерцательная концентрация и успокоение ума в медитации уже давно перестало быть атрибутом какой-либо религиозной традиции , и для все большего числа людей становится неотъемлемой частью их жизни, позволяющей разобраться с трудностями жизни и лучше понять себя и окружающих."
        },
        {
            "letters": "B",
            "title": "Международный буквенный счет и учет",
            "type":"design",
            "img": "http://www.fondfrukt.ru/images/set1.svg",
            "text": "## АВЕКМНОРСТУХ\nУниверсальная двенадцатибуквенная система счета уникальных объектов, а также их взаимосвязей."
        },
        {
            "letters": "C",
            "title": "Фруктовый дискурс",
            "type":"design",
            "img": "http://www.fondfrukt.ru/images/icons-exp.svg",
            "text": "Язык и система целенаправленного общения и взаимодействия людей."
        },
        {
                "letters": "C|B",
                "title": "Личность",
                "text": "— свод данных, характеризующих конкретное лицо или вымышленного персонажа.",
                "type": "persona"
            },
            {
                "letters": "C|B|A",
                "title": "Личность: свод данных",
                "text": "- любые авторские произведения, \n- ник,\n- ФИО,\n- телефон\n- email\n- аккаунты в социальных сетях.\n"
            },
            {
                "letters": "C|E",
                "title": "Лицо",
                "text": "— человек, подтвердивший свою личность.",
                "type": "face"
            },
            {
                "letters": "C|E|Y",
                "title": "",
                "text": "Лицом может стать любое физическое лицо, способное подтвердить свою личность."
            },
            {
                "letters": "C|E|P",
                "title": "Лицо затеи",
                "type": "designFace",
                "text": "— конечный адресат всех вопросов, связанных с этой затеей. Глаза, уши, нос и рот затеи."
            },
            {
                "letters": "C|A",
                "title": "Штука",
                "text": "— материальная сущность.",
                "type": "thing"
            },
            {
                "letters": "C|X",
                "title": "Задача",
                "text": "– описание результативного действия с приложением всей необходимой для его совершения информации.",
                "type": "task"
            },
            {
                "letters": "C|X|A",
                "title": "Полная задача",
                "text": "подразумевает наличие инвентаря и необходимых материалов."
            },
            {
                "letters": "C|X|O",
                "title": "Выполнение задачи возмездно",
                "text": "в зависимости от количества шагов, их сложности, а также от статуса собственности материалов и результатов выполнения задачи."
            },
            {
                "letters": "C|X|A|M",
                "title": "Всегда есть несколько способов наполнения задачи для ее выполнения.",
                "text": ""
            },
            {
                "letters": "C|H",
                "title": "Затея",
                "text": "— план реализации общественно-значимых инфраструктурных объектов или событий.",
                "type": "design"
            },
            {
                "letters": "C|C",
                "title": "Событие",
                "text": "— ограниченная по времени совместная деятельность или информация о ней, подтвержденная участниками.",
                "type": "event"
            },
            {
                "letters": "C|P",
                "title": "Фонд развития",
                "text": "— открытый экономический интерфейс."
            },
            {
                "letters": "A|M",
                "title": "Миссия ФРУКТа",
                "text": "Всестороннее разнонаправленное развитие творческого потенциала каждого человека в коллективной реализации затей."
            },
            {
                "letters": "C|Y",
                "title": "Универсализация",
                "text": "— реализация стремления каждого элемента системы овладеть практическим опытом многостороннего изучения всей системы."
            },
            {
                "letters": "C|K",
                "title": "Кооперация",
                "text": "— сложение всех возможных усилий для выполнения задач, невыполнимых индивидуально."
            },
            {
                "letters": "C|T",
                "title": "Творчество",
                "text": "— процесс осознанного приложения свободно определяемого усилия с целью увеличения меры совершенства окружающего мира."
            },
            {
                "letters": "C|HA",
                "title": "Навык",
                "text": "— умение реализовывать известные задачи или получать творческие результаты с применением соответствующего инструмента по назначению, а также руководство по овладению им.",
                "type": "skill"
            },
            {
                "letters": "C|BO",
                "title": "Лексическая форма",
                "text": "— форма применения слова в контексте языка.",
                "img": ""
            },
            {
                "letters": "C|BC",
                "title": "Высказывание",
                "text": "— любая информативная фраза, содержащая упоминание ее автора, а также хотя бы одного адресата или предмета этой фразы.",
                "img": ""
            },
            {
                "letters": "C|AP",
                "title": "Дар",
                "text": "— любая ценность, принятая фондом развития и направленная на реализацию его затей, а также информация о ней.",
                "type": "donation"
            },
            {
                "letters": "C|BC|T",
                "title": "Личные высказывания",
                "text": "предназначены для получения только их адресатами.",
                "img": ""
            },
            {
                "letters": "C|X|O|P",
                "title": "Шаг задачи",
                "text": "— ограниченное по времени и направлению приложения усилия **выполнимое** действие одного человека.",
                "img": ""
            },
            {
                "letters": "C|P|A",
                "title": "Развитие",
                "text": "— движение системы к сместившейся точке равновесия.",
                "img": ""
            },
            {
                "letters": "C|P|Y",
                "title": "Фонд, юридически",
                "text": "— некоммерческая организация, все ресурсы которой направляются только на выполнение ее миссии.",
                "img": ""
            },
            {
                "letters": "C|P|E",
                "title": "Реализация целей и идей",
                "text": "Фонд развития обеспечивает системную реализацию затей, способствующих достижению его целей и осуществлению его обоснованных идей.",
                "img": ""
            },
            {
                "letters": "C|P|E|K",
                "title": "Цели",
                "text": "Цели фонда развития содержатся в его **Миссии**.",
                "img": ""
            },
            {
                "letters": "C|P|E|B",
                "title": "Идеи",
                "text": "Идеи фонда развития содержатся в его **названии** и в тексте их **обоснования**.",
                "img": ""
            },
            {
                "letters": "C|Y|B",
                "title": "Вопросы Универсализации",
                "text": "",
                "type": "question"
            },
            {
                "letters": "C|Y|B|H",
                "title": "",
                "text": "Буду ли я делать что-то новое и необычное для меня?",
                "img": ""
            },
            {
                "letters": "C|Y|B|M",
                "title": "",
                "text": "Это непривычная деятельность?",
                "img": ""
            },
            {
                "letters": "C|Y|B|Y",
                "title": "",
                "text": "Научит ли это меня чему-то новому?",
                "img": ""
            },
            {
                "letters": "C|Y|B|P",
                "title": "",
                "text": "Есть ли возможность попробовать себя в новой роли?",
                "img": ""
            },
            {
                "letters": "C|K|B",
                "title": "Вопросы Кооперации",
                "text": "",
                "type": "question"
            },
            {
                "letters": "C|K|B|A",
                "title": "",
                "text": "Это невозможно сделать в одиночку?",
                "img": ""
            },
            {
                "letters": "C|K|B|O",
                "title": "",
                "text": "Помощь других будет полезна?",
                "img": ""
            },
            {
                "letters": "C|K|B|C",
                "title": "",
                "text": "Усилия всех участников складываются?",
                "img": ""
            },
            {
                "letters": "C|K|B|H",
                "title": "",
                "text": "Победителей и побежденных быть не может?",
                "img": ""
            },
            {
                "letters": "C|T|B",
                "title": "Вопросы Творчества",
                "text": "",
                "type": "question"
            },
            {
                "letters": "C|T|B|O",
                "title": "",
                "text": "Будет ли что-то создано в результате?",
                "img": ""
            },
            {
                "letters": "C|T|B|C",
                "title": "",
                "text": "Свободно ли определение прилагаемого усилия?",
                "img": ""
            },
            {
                "letters": "C|T|B|P",
                "title": "",
                "text": "Осознанно ли приложение усилия?",
                "img": ""
            },
            {
                "letters": "C|T|B|B",
                "title": "",
                "text": "Повышается ли мера совершенства окружающего мира?",
                "img": ""
            },
            {
                "letters": "C|Y|Y",
                "title": "Утверждения Универсализации",
                "text": "",
                "type": "statement"
            },
            {
                "letters": "C|Y|Y|A",
                "title": "",
                "text": "Никогда не делал ничего подобного.",
                "img": ""
            },
            {
                "letters": "C|Y|Y|M",
                "title": "",
                "text": "Можно научиться что-то делать и что-то сделать.",
                "img": ""
            },
            {
                "letters": "C|Y|Y|O",
                "title": "",
                "text": "Как раз хотел получить навыки из этой сферы знания.",
                "img": ""
            },
            {
                "letters": "C|Y|Y|H",
                "title": "",
                "text": "Это может дать много полезного нового опыта.",
                "img": ""
            },
            {
                "letters": "C|K|Y",
                "title": "Утверждения Кооперации",
                "text": "",
                "type": "statement"
            },
            {
                "letters": "C|K|Y|M",
                "title": "",
                "text": "В одиночку это невозможно.",
                "img": ""
            },
            {
                "letters": "C|K|Y|H",
                "title": "",
                "text": "Я помогу и мне помогут.",
                "img": ""
            },
            {
                "letters": "C|K|Y|K",
                "title": "",
                "text": "Каждый найдет, чем заняться полезным.",
                "img": ""
            },
            {
                "letters": "C|K|Y|B",
                "title": "",
                "text": "Вместе, сложив усилия, мы сделаем это реальным.",
                "img": ""
            },
            {
                "letters": "C|T|Y",
                "title": "Утверждения творчества",
                "text": "",
                "type":"statement"
            },
            {
                "letters": "C|T|Y|M",
                "title": "",
                "text": "В результате получится новая штука.",
                "img": ""
            },
            {
                "letters": "C|T|Y|T",
                "title": "",
                "text": "Это может дать возможность записать на долговечный носитель **творческую информацию** о штуке или событии.",
                "img": ""
            },
            {
                "letters": "C|T|Y|K",
                "title": "",
                "text": "Это сделает мир ближе к совершенству.",
                "img": ""
            },
            {
                "letters": "C|T|Y|P",
                "title": "",
                "text": "Удалось запечатлеть редкую творческую информацию.",
                "img": ""
            },
            {
                "letters": "C|T|E",
                "title": "Творческая информация",
                "text": "— информация о гармонии, структуре, порядке, способах реализации, созидательном опыте.",
                "img": ""
            },
            {
                "letters": "C|Y|H",
                "title": "Универсализация",
                "text": "— это процесс разработки и доказательства новых **навыков**, а также процесс обмена уже имеющимися.",
                "img": ""
            },
            {
                "letters": "C|T|E|H",
                "title": "",
                "text": "Документация процесса разработки и доказательства новых **навыков**, а также любая информация, способствующая процессу обмена навыками — **творческая информация**.",
                "img": ""
            },
            {
                "letters": "C|K|O",
                "title": "",
                "text": "Объединение для разработки и доказательства новых навыков и обмена уже имеющимися — **кооперация**, т.к. задача **универсализации** в рамках общества неразрешима индивидуально.",
                "type": "skill"
            },
            {
                "letters": "C|X|A|H",
                "title": "Наиболее полная задача",
                "text": "предполагает наличие:\n- необходимого и достаточного **инструмента** с описанием его назначения,\n- инструкции ко всем задействованным **навыкам**,\n- весь необходимый **материал** для получения навыков и выполнения задачи,\n- варианты возмещения труда.",
                "type": "task"
            },
            {
                "letters": "C|P|E|A",
                "title": "Дерево фонда",
                "text": "— система реализации затей этого фонда.",
                "img": ""
            },
            {
                "letters": "A|C",
                "title": "Фруктовое дерево",
                "text": "— система реализации **фруктовых** затей.",
                "img": ""
            },
            {
                "letters": "A|C|C",
                "title": "",
                "text": "**ФРУКТ** предоставляет интерфейсы доступа к фруктовому дереву.",
                "img": ""
            },
            {
                "letters": "A|O",
                "title": "Интерфейсы ФРУКТа",
                "text": "",
                "img": ""
            },
            {
                "letters": "A|O|Y",
                "title": "",
                "text": "Обзор дерева затей",
                "img": ""
            },
            {
                "letters": "A|O|B",
                "title": "Песочница",
                "text": "Доступ к системе индивидуальной и коллективной **разработки затей**.",
                "type": "sandbox"
            },
            {
                "letters": "A|O|P",
                "title": "УКТ",
                "text": "Доступ к системе рейтинга затей **УКТ**.",
                "img": ""
            },
            {
                "letters": "A|O|O",
                "title": "Задачи",
                "text": "Доступ к списку **настоящих задач** фруктовых затей с возможностью вписаться на их выполнение.",
                "type": "task"
            },
            {
                "letters": "A|O|M",
                "title": "Поставки",
                "text": "Доступ к списку необходимых для реализации затей **поставок** с возможностью вписаться на их реализацию.",
                "type": "demand"
            },
            {
                "letters": "A|O|A",
                "title": "Вывеска затеи",
                "text": "Доступ к **полной информации** затеи с возможностью добавления информации лицами и участниками данной затеи.",
                "type":"design"
            },
            {
                "letters": "A|O|C",
                "title": "Стена затеи",
                "text": "— собрание событий с упоминанием этой затеи, высказываний ее лиц, участников и личностей, совершивших дар, а также событий этой затеи, вносимых ее лицами.",
                "img": ""
            },
            {
                "letters": "A|O|H",
                "title": "Личности",
                "text": "Доступ к списку личностей с возможностью просмотра их **публичной** информации.",
                "type": "persona"
            },
            {
                "letters": "A|O|K",
                "title": "ЭКошелек",
                "text": "Доступ к **ЭКошельку** личности с возможностью внесения средств, формирования даров и управления ими, а также отслеживания их совершения.",
                "type": "donation"
            },
            {
                "letters": "A|O|Y|E",
                "title": "",
                "text": "Обзор дерева затей предоставляет возможность просмотра и анализа подробной информации о настоящем и предыдущих состояниях **кроны** и **ствола**, а также доступной информации о **корнях** дерева.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|O",
                "title": "Крона",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|P|E|A|O|B",
                "title": "",
                "text": "Система разработки и публикации затей.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|O|P",
                "title": "Рейтинг",
                "text": "Система отбора и рейтинга затей.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|O|O",
                "title": "",
                "text": "Система выполнения настоящих задач актуальных затей.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|O|M",
                "title": "",
                "text": "Система обеспечения поставок материалов, необходимых для реализации затей.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|O|C",
                "title": "",
                "text": "Система информационной поддержки затей.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|K",
                "title": "Корневая система",
                "text": "обеспечивает прием и хранение средств и штук населения, а также формирование из них даров и направление их на реализацию затей.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|B",
                "title": "Ствол",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|P|E|A|B|A",
                "title": "",
                "text": "Система учета и логистики даров.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|B|T",
                "title": "",
                "text": "Система хранения и транспортировки даров.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|B|P",
                "title": "",
                "text": "Система рециркуляции несовершённых даров.",
                "img": ""
            },
            {
                "letters": "C|P|E|A|B|O",
                "title": "",
                "text": "Система обмена информацией между кроной и корневой системой.",
                "img": ""
            },
            {
                "letters": "A|C|A",
                "title": "Крона фруктового дерева",
                "text": "",
                "img": ""
            },
            {
                "letters": "A|C|A|H",
                "title": "Песочница",
                "text": "— инкубатор затей.",
                "type": "sandbox"
            },
            {
                "letters": "A|C|A|B",
                "title": "Каталог затей",
                "text": "",
                "type":"design"
            },
            {
                "letters": "A|C|A|A",
                "title": "Витрина задач",
                "text": "",
                "type": "task"
            },
            {
                "letters": "A|C|A|T",
                "title": "Витрина поставок",
                "text": "",
                "type": "demand"
            },
            {
                "letters": "A|C|A|P",
                "title": "Ленты высказываний",
                "text": "",
                "img": ""
            },
            {
                "letters": "A|C|A|O",
                "title": "Личное—Публичное",
                "text": "— система доставки и публикации высказываний.",
                "img": ""
            },
            {
                "letters": "A|C|A|C",
                "title": "Ленты событий",
                "text": "Система уведомления о настоящих событиях.",
                "img": ""
            },
            {
                "letters": "A|C|T",
                "title": "Ствол фруктового дерева",
                "text": "",
                "img": ""
            },
            {
                "letters": "A|C|T|Y",
                "title": "",
                "text": "Автоматизированный учет даров.",
                "img": ""
            },
            {
                "letters": "A|C|T|O",
                "title": "",
                "text": "Управляемая автоматическая логистика даров.",
                "img": ""
            },
            {
                "letters": "A|C|T|A",
                "title": "",
                "text": "Децентрализованная сеть транспортировки даров.",
                "img": ""
            },
            {
                "letters": "A|C|T|E",
                "title": "",
                "text": "Комиссионная рециркуляция несовершённых даров.",
                "img": ""
            },
            {
                "letters": "A|C|T|P",
                "title": "",
                "text": "Высокоскоростное уведомление о создании, направлении и продвижении даров.",
                "img": ""
            },
            {
                "letters": "A|C|E",
                "title": "Корневая система фруктового дерева",
                "text": "",
                "img": ""
            },
            {
                "letters": "A|C|E|H",
                "title": "",
                "text": "Распределенная сеть пунктов учёта, приёма, сбора и временного хранения различных средств и разных штук, принятых в качестве дара, направленного на реализацию фруктовых затей.",
                "img": ""
            },
            {
                "letters": "A|C|E|A",
                "title": "",
                "text": "Децентрализованная сеть пунктов хранения личной—публичной информации с расширяемой системой подтверждения личностей.",
                "img": ""
            },
            {
                "letters": "A|C|E|B",
                "title": "",
                "text": "Устойчивая сеть высокоскоростной передачи и надежного хранения творческой информации, а также других фруктовых данных.",
                "img": ""
            },
            {
                "letters": "C|H|Y|A",
                "title": "Каталог фонда затей",
                "text": "— это список всех опубликованных затей фонда с возможностью просмотра и пополнения их **вывесок**, **стен** и **окон**.",
                "img": ""
            },
            {
                "letters": "C|H|O",
                "title": "Окно затеи",
                "text": "Поток актуальной информации о затее от её лиц и участников, а также иной информации, связанной с затеей, одобренной к публикации ее лицами.",
                "img": ""
            },
            {
                "letters": "C|H|C",
                "title": "Стена затеи",
                "text": "Собрание событий с упоминанием этой затеи, а также высказываний о ней от ее лиц, участников, а также от личностей, совершивших **дар** и авторов ее оценки **УКТ**.",
                "img": ""
            },
            {
                "letters": "C|H|B",
                "title": "Вывеска затеи",
                "text": "содержит всю необходимую для реализации затеи информацию.",
                "img": ""
            },
            {
                "letters": "C|H|Y",
                "title": "Фонд затей",
                "text": "Собрание затей, объединенных целями и идеями этого фонда.",
                "img": ""
            },
            {
                "letters": "C|H|B|X",
                "title": "Порядок",
                "text": "Буквенный порядок в каталоге затей.",
                "img": ""
            },
            {
                "letters": "C|H|B|A",
                "title": "Названия",
                "text": "Названия затеи на разных языках.",
                "img": ""
            },
            {
                "letters": "C|H|B|P",
                "title": "Идея",
                "text": "Мысль, предлагаемая к реализации.",
                "img": ""
            },
            {
                "letters": "C|H|B|K",
                "title": "Цели",
                "text": "Особенности предполагаемых результатов реализации затеи.",
                "img": ""
            },
            {
                "letters": "C|H|B|H",
                "title": "Суть",
                "text": "Схема действий, необходимых для реализации затеи, а также описание достаточного количества и качества материалов.",
                "img": ""
            },
            {
                "letters": "C|H|B|H|Y",
                "title": "Графиколексические упоминания",
                "text": "Суть затеи содержит упоминания всех настоящих **ступеней**, **задач**, **поставок**, **событий** в наглядной графиколексической форме.",
                "img": ""
            },
            {
                "letters": "C|H|B|M",
                "title": "Места",
                "text": "Возможно точное описание расположения точек реализации затеи и точек поставок и задач.",
                "img": ""
            },
            {
                "letters": "C|H|B|E",
                "title": "Сроки",
                "text": "Возможно точные даты и длительности ступеней реализации затеи.",
                "img": ""
            },
            {
                "letters": "C|H|B|T",
                "title": "Информация о лицах и участниках",
                "text": "Вся доступная публичная информация о **лицах** затеи и ее участниках.",
                "img": ""
            },
            {
                "letters": "C|H|B|C",
                "title": "Контакты представительств",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|H|B|X",
                "title": "Статусное состояние",
                "text": "Собрание всех настоящих статусов всех ступеней затеи.",
                "img": ""
            },
            {
                "letters": "C|H|B|T",
                "title": "Теория затеи",
                "text": "Обоснование затеи и теоретический дискурс.",
                "img": ""
            },
            {
                "letters": "C|H|B|Y",
                "title": "Ответы на частые вопросы",
                "text": "**Лица** обязаны отвечать на любые вопросы, связанные с реализуемой затеей, ответы собираются и группируются.",
                "img": ""
            },
            {
                "letters": "C|H|B|YK",
                "title": "Оценка УКТ",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|H|B|OA",
                "title": "План поставок",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|H|B|EO",
                "title": "План задач",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|H|B|OA|P",
                "title": "Архив поставок",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|H|B|EO|P",
                "title": "Архив задач",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|H|B|PE",
                "title": "Обзор результатов",
                "text": "",
                "img": ""
            },
            {
                "letters": "A|O|X",
                "title": "Личное—Публичное",
                "text": "Система доставки **личных** и издания **публичных** высказываний.",
                "img": ""
            },
            {
                "letters": "C|BC|E",
                "title": "Публичные высказывания",
                "text": "Высказывания, содержащие упоминания хотя бы одного предмета дискурса.",
                "img": ""
            },
            {
                "letters": "A|X",
                "title": "Фруктовый дискурс",
                "text": "Включает **дары**, а также все элементы затей, в том числе и самого **ФРУКТ**а.",
                "img": ""
            },
            {
                "letters": "A|H",
                "title": "ФРУКТ — это такая ежегодная затея.",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|BC|Y",
                "title": "Ленты высказываний",
                "text": "Последовательности связанных высказываний.",
                "img": ""
            },
            {
                "letters": "C|BC|Y|E",
                "title": "Ленты привязаны",
                "text": "Ленты высказываний привязаны к упоминаемым этими высказываниями **личностям** или иным **предметам дискурса**.",
                "img": ""
            },
            {
                "letters": "C|BC|T|A",
                "title": "Личные ленты",
                "text": "Связывают адресатов.",
                "img": ""
            },
            {
                "letters": "C|BC|E|M",
                "title": "Публичные ленты",
                "text": "Привязаны к предметам дискурса.",
                "img": ""
            },
            {
                "letters": "C|AP|O",
                "title": "",
                "text": "Дар обязательно содержит свой уникальный порядок и **определение его ценности**.",
                "img": ""
            },
            {
                "letters": "C|AP|A",
                "title": "Определение ценности",
                "text": "Состоит из **качественного** и **количественного** описаний.",
                "img": ""
            },
            {
                "letters": "C|AP|A|A",
                "title": "Качественное описание не бывает короче двух слов.",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|AP|A|O",
                "title": "Количественное описание",
                "text": "Свод значимых результатов измерения в стандартных единицах.",
                "img": ""
            },
            {
                "letters": "C|C|Y",
                "title": "Создание события",
                "text": "События создаются первым упоминанием их **порядка**, **названия**, возможно точной **даты** и **времени (длительности)**, а также **места** и возможного количества участников и свидетелей в одном высказывании.",
                "img": ""
            },
            {
                "letters": "C|C|Y|A",
                "title": "Деятель",
                "text": "Автор такого первого высказывания становится **автором** и **участником** события — его **деятелем**.",
                "img": ""
            },
            {
                "letters": "C|C|E",
                "title": "Деятель может",
                "text": "Деятель события может предоставить личностям право тоже стать деятелем, либо отдельно автором или участником или свидетелем этого события в рамках возможного их количества.",
                "img": ""
            },
            {
                "letters": "C|C|Y|E",
                "title": "",
                "text": "Для изменения начальных условий нужно согласие более, чем половины ее деятелей.",
                "img": ""
            },
            {
                "letters": "C|AP|E",
                "title": "Уточнения",
                "text": "Лица, формирующие дары из предоставленных ими ФРУКТу ценностей, могут предусмотреть **уточнения**.",
                "img": ""
            },
            {
                "letters": "C|AP|E|H",
                "title": "Уточнение места",
                "text": "Определение территории, на которой возможно совершение этого дара, с любой точностью.\n\nПланета — континент — регион — страна — область — поселение — район — улица — здание — помещение... или координаты точки.",
                "img": ""
            },
            {
                "letters": "C|AP|E|B",
                "title": "Уточнение времени",
                "text": "Диапазон допустимых дат и времени совершения дара внутри **одного года** со для его формирования.",
                "img": ""
            },
            {
                "letters": "C|AP|E|K",
                "title": "Уточнение затеи или класса затей.",
                "text": "Список желательных и нежелательных затей для получения данного дара.",
                "img": ""
            },
            {
                "letters": "C|AP|E|C",
                "title": "Уточнение лиц",
                "text": "Список желательных и нежелательных лиц, реализующих затеи.",
                "img": ""
            },
            {
                "letters": "C|AP|E|Y",
                "title": "Уточнение УКТ",
                "text": "Желательный рейтинг УКТ затеи.",
                "img": ""
            },
            {
                "letters": "C|AP|E|A",
                "title": "Уточнение назначения",
                "text": "Назначить дар можно на выполнение определенного типа задач и/или определенного типа поставок.",
                "img": ""
            },
            {
                "letters": "C|H|K",
                "title": "Класс затей",
                "text": "Группа затей, объединенных общим названием, идеей, целью, теорией.",
                "img": ""
            },
            {
                "letters": "C|AP|E|O",
                "title": "Уточнение статуса и ступени",
                "text": "",
                "img": ""
            },
            {
                "letters": "C|H|A",
                "title": "Ступень затеи",
                "text": "Отдельный этап реализации затеи с получением конкретных результатов в известные сроки.",
                "img": ""
            },
            {
                "letters": "C|H|A|A",
                "title": "Ступень — это",
                "text": "создание объекта или проведение события.",
                "img": ""
            },
            {
                "letters": "C|H|A|M",
                "title": "Две и более",
                "text": "План затеи содержит не менее двух ступеней.",
                "img": ""
            },
            {
                "letters": "C|H|A|H",
                "title": "Первый уровень",
                "text": "Ступени первого уровня реализуются независимо.",
                "img": ""
            },
            {
                "letters": "C|H|A|B",
                "title": "Уровни выше",
                "text": "Ступени уровней выше зависят от результатов нижележащих опорных ступеней и реализуются только после их завершения.",
                "img": ""
            },
            {
                "letters": "A|P",
                "title": "ФРУКТ — это",
                "text": "Открытый экономический интерфейс, предоставляющий возможность реализации общественно-значимых инфраструктурных проектов — **затей** — прозрачным способом коллективного взаимодействия, т.е. **открытая система общественного взаимодействия**.",
                "img": ""
            },
            {
                "letters": "C|BX",
                "title": "Возможность",
                "text": "**Целенаправленная полезная деятельность** человека или группы людей с применением соответствующих **инструментов** и **материалов**, ограниченная по времени и географически,  а также свод информации, необходимой для ее осуществления."
            },
            {
                "letters": "C|X|B",
                "text": "**Задача** — реализация возможностей в пользу **затей**, а также их **лиц**, отдельных **личностей**, **групп людей** или **общества** вцелом.",
                "title": "Возможности задачи"
            },
            {
                "letters": "C|Y|K",
                "title": "Коллективная оценка",
                "text": "Контроль соответствия **идей** и **целей затеи**  идеям ** и**  целям ** Фонда**  осуществляется **коллективной оценкой.**"
            },
            {
                "letters": "C|HA|C",
                "title": "Приобрести существующий навык",
                "text": "**Существующий навык** можно приобрести выполнив известную задачу в присутствии, при поддержке и под руководством уже имеющего этот навык."
            },
            {
                "letters": "C|HA|H",
                "title": "Доказать новый навык",
                "text": "**Новый навык** можно **доказать**, получив заранее определенные творческие результаты в присутствии и при поддержке **лиц**, имеющих близкие навыки."
            },
        {
            "letters": "E",
            "title": "Интерфейс совместной разработки и реализации затей \"Ленты\"",
            "text": "",
            "author": "star",
            "time": 1407926074974,
            "type":"design"
        },
        {
             "letters": "E|T|O|O",
            "title": "Купоны действительны до 31.08.2014",
            "text": "",
            "author": "star",
            "time": 1407926074974
        },
        {
             "letters": "E|T|E",
            "title": "Идея",
            "text": "Встреча-показ настоящих материалов **ФРУКТ**а, раскрытие  его идей и текущего состояния разработки его интерфейсов. Тестирование и совместная разработка веб-интерфейса для управления проектами **\"Ленты затей.\"**",
            "author": "star",
            "time": 1407926933278
        },
        {
             "letters": "E|T|X",
            "title": "Цели",
            "text": "",
            "author": "star",
            "time": 1407927073956
        },
        {
             "letters": "E|T|X|B",
            "title": "Провести целый день в коворкинге",
            "text": "Изучить на практике само явление под названием \"коворкинг\" и на практике убедиться в его возможности углублять сотрудничество между людьми.",
            "author": "star",
            "time": 1407928051768
        },


        {
             "letters": "E|T|E",
            "title": "Идея",
            "text": "Встреча-показ настоящих материалов **ФРУКТ**а, раскрытие его идей и текущего состояния разработки его интерфейсов. **Тестирование и совместная разработка** веб-интерфейса для управления проектами **\"Ленты\"**",
            "author": "star",
            "time": 1407930257633
        },
        {
             "letters": "E|T|X|P",
            "title": "Демонстрация и объяснение \"Лент\"",
            "text": "Интерфейс, через который отображается эта информация, называется **\"Ленты\"** и представляет собой **HTML5+JS** приложение для разработки и реализации различных событий и других затей. Пока оно работает на одном только **AngularJS** и, сохраняя все данные только в **localStorage**, не реализует важнейшую возможность **совместной** разработки и реализации уже существующих и новых затей.",
            "author": "star",
            "time": 1407930378542
        },
        {
             "letters": "E|T|X|C",
            "title": "Совместно внедрить возможности совместной разработки \"Лент\"",
            "text": "Соблюдая принцип **offline-first**, внедрить в возможность **синхронизации** информации о настоящем состоянии \"Лент\" **между клиентами**.",
            "author": "star",
            "time": 1407930902194
        },
        {
             "letters": "E|T|X|O",
            "title": "Обменяться информацией о ФРУКТе",
            "text": "Совместно изучить **настоящие материалы** ФРУКТа, обменяться вопросами и ответами на тему возможных путей его развития.",
            "author": "star",
            "time": 1407931110644
        },
        {
             "letters": "E|T|O",
            "title": "Бесплатно!",
            "text": "Есть **6 купонов** \"Тестовый день в коворкинге\"",
            "author": "star",
            "time": 1407931154684
        },
        {
             "letters": "E|T|X|K",
            "title": "Наладить контакты",
            "text": "За эту встречу попытаться найти некоторое **взаимопонимание** и опыт **совместной разработки открытого интерфейса**. Обеспечить возможность в дальнейшем продолжить совместную разработку как в формате аналогичных **встреч**, так и через **Интернет**.",
            "author": "star",
            "time": 1407931547554
        },
        {
             "letters": "E|T|K",
            "title": "14 августа 2014 года",
            "text": "* **10:00 — 12:00** Сбор, показ настоящих материалов ФРУКТа\n* **12:00 — 13:00** Рассказ-обсуждение о ФРУКТе, его затеях и путях их реализации\n* **13:00 — 13:30** Рассмотрение возможных вариантов реализации **\"Публичных Лент\"**\n* **13:30 — 18:00** Совместная **HTML5 +  CSS3+ JS** front-end и **JS + Ruby + PHP + ...** back-end разработка\n* **18:00 — 19:00** **Тестирование и слияние** произведенных наработок\n* **19:00 — 20:00** **Презентация и тестирование** полученного результата, подведение итогов, налаживание контактов",
            "author": "star",
            "time": 1407933429985
        },
        {
             "letters": "E|T|X|C",
            "title": "Вместе сделать \"Ленты\" публичными",
            "text": "Соблюдая принцип **offline-first**, хотя бы для **\"Личных лент\"**, внедрить в возможность **синхронизации информации** о настоящем состоянии хотя бы **\"Публичных лент\"** между клиентами.",
            "author": "star",
            "time": 1407933592416
        },
        {
            "letters": "E|T",
            "title": "Фруктовый хакатон",
            "img": "http://www.frkt.ru/images/FRUKTaton.svg",
            "author": "star",
            "type": "event",
            "time": 1407945939235
        },

        {
             "letters": "E|T|T",
            "title": "DI Telegraph",
            "img": "http://ditelegraph.ru/assets/logo-851863a75e0e19ec40abd35af6b4db5c.svg",
            "text": "http://ditelegraph.ru/",
            "author": "star",
            "time": 1407947018734
        },
        {
             "letters": "E|T|T|T",
            "title": "Москва, Тверская 7",
            "author": "star",
            "time": 1407947057687
        },
        {
             "letters": "E|T|C",
            "title": "Суть",
            "text": "Взяв с собой **мешок фруктов** и собрав в коворкинге **заинтересованных людей**, попытаться **доработать интерфейс \"Лент\"** в плане реализации **синхронизации данных** между различными клиентами одним или несколькими предложенными способами:",
            "author": "star",
            "time": 1407947518631
        },
        {
             "letters": "E|T|C|Y",
            "title": "Прямые клиентские связи с PeerJS",
            "text": "Один из вариантов реализации — синхронизация данных непосредственно **между клиентами** при помощи **WebRTC** или конкретно **[PeerJS](http://peerjs.com/)**",
            "author": "star",
            "time": 1407947699119
        },
        {
             "letters": "E|T|C|B",
            "title": "BaaS Firebase.com",
            "text": "Реализация хранения и синхронизации данных на серверах **Back-end as a Service** службы **[Firebase.com](http://www.firebase.com)** при помощи библиотеки **AngularFire**.",
            "author": "star",
            "time": 1407947886022
        },
        {
             "letters": "E|T|C|H",
            "title": "Поднятие сервера SynthJS",
            "text": "Реализация собственного сервера на базе **NodeJS** и специально спроектированного для взаимодействия с **AngularJS** сервера **SynthJS** или его аналога.",
            "author": "star",
            "time": 1407947993351
        },
        {
             "letters": "E|T|C|M",
            "title": "Реактивная синхронизация SwarmJS",
            "text": "**Реактивная синхронизация** данных между серверами и клиентами с помощью библиотеки **[SwarmJS](https://github.com/gritzko/swarm)**",
            "author": "star",
            "time": 1407948203550
        },
        {
             "letters": "E|T|C|H",
            "title": "Поднятие сервера SynthJS",
            "text": "Реализация собственного сервера на базе **NodeJS** и какой-либо базы данных, например **MongoDB** и специально спроектированного для взаимодействия с **AngularJS** сервера **SynthJS** или его аналога.",
            "author": "star",
            "time": 1407948967639
        },
        {
             "letters": "E|T|C|A",
            "title": "Разработка Ruby-on-Rails сервера",
            "text": "Разработка и запуск бэкенда на фреймворке **Ruby-on-Rails**.",
            "author": "star",
            "time": 1407949056751
        }

    ]
});
